{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import binascii\n",
    "import sys\n",
    "import traceback\n",
    "from block import Block\n",
    "from helper import read_varint, hash256\n",
    "from tx import Tx\n",
    "import subprocess\n",
    "import os\n",
    "from time import sleep\n",
    "from subprocess import Popen, PIPE\n",
    "import logging\n",
    "import concurrent.futures\n",
    "from multiprocessing import Pool\n",
    "#logging.basicConfig(filename='parsing.log',level=logging.DEBUG,format='%(asctime)s %(message)s')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from logging.handlers import RotatingFileHandler\n",
    "\n",
    "log_formatter = logging.Formatter('%(asctime)s %(levelname)s %(funcName)s(%(lineno)d) %(message)s')\n",
    "\n",
    "logFile = 'log/parsing.log'\n",
    "\n",
    "my_handler = RotatingFileHandler(logFile, mode='a', maxBytes=10*1024*1024,backupCount=6, encoding=None, delay=0)\n",
    "my_handler.setFormatter(log_formatter)\n",
    "my_handler.setLevel(logging.INFO)\n",
    "\n",
    "app_log = logging.getLogger('root')\n",
    "app_log.setLevel(logging.INFO)\n",
    "\n",
    "app_log.addHandler(my_handler)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "class BlockChainDB(object):\n",
    "\n",
    "    def __init__(self, uri=None, user=None, password=None, driver=None):\n",
    "        if driver is None:\n",
    "            self._driver = GraphDatabase.driver(uri, auth=(user, password), encrypted=False)#REVISE LATER FOR ENCRYPTION!!!\n",
    "        else:\n",
    "            self._driver = driver\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "        \n",
    "        \n",
    "    @staticmethod\n",
    "    def _new_address(tx, address,i,change_addr):\n",
    "        if change_addr: addr_type = \"change\"\n",
    "        else: addr_type = \"recipient\"\n",
    "        result = tx.run(\"CREATE a = (:address {address:$address, acc_index:$index, type:$kind, created:timestamp()}) \"\n",
    "                        \"RETURN a \", address=address, index = i, kind = addr_type)\n",
    "        return result.single()\n",
    "    \n",
    "    \n",
    "    @staticmethod\n",
    "    def _new_tx(tx,block_id, version, locktime, tx_id, inputs, outputs, segwit, i):\n",
    "                    \n",
    "        result = tx.run(\"MATCH (b:block {id:$block_id}) \"\n",
    "                        \"MERGE (t:transaction {id:$tx_id}) \"\n",
    "                        \"SET t.version=$version, t.segwit=$segwit, t.locktime=$locktime \"\n",
    "                        \"MERGE (t)<-[:CONTAINS {i:$i}]-(b) \"\n",
    "                        \"RETURN t \",\n",
    "                        tx_id=tx_id, segwit=segwit, version=version, locktime=locktime, block_id=block_id,i=i)\n",
    "        \n",
    "        if len(result.data()) >0: app_log.info(f\"created tx: {tx_id}\\n{result.data()}\")\n",
    "        else: app_log.error(f\"FAILED AT CREATING TX {tx_id}\")\n",
    "        \n",
    "        for index,tx_out in enumerate(outputs):\n",
    "            result = tx.run(\"MATCH (t:transaction {id : $tx_id}) \"\n",
    "                        \"MERGE (o:output {index:$index})<-[:CREATES]-(t) \"\n",
    "                        \"SET o.amount=$amount, o.script_pubkey=$script_pubkey \"\n",
    "                        \"RETURN o \", \n",
    "                        tx_id = tx_id,amount=tx_out.amount,script_pubkey=str(tx_out.script_pubkey), index=index)\n",
    "            if len(result.data()) > 0: app_log.info(f\"created output: {tx_out.amount}:{index} for tx {tx_id}\")\n",
    "            else: app_log.error(f\"FAILED AT CREATING OUTPUT {index}\")  \n",
    "                \n",
    "        for tx_in in inputs:\n",
    "            if tx_in.prev_index == 4294967295 or tx_in.prev_tx == (b'\\x00'*32).hex():\n",
    "                    app_log.info(\"Coinbase Transaction \" + tx_id)\n",
    "            else: \n",
    "                result = tx.run(\"MERGE (t:transaction {id : $tx_id}) \"\n",
    "                            #\"MERGE (p:transaction {id:$prev_tx})\"\n",
    "                            \"MERGE (tx_in :output {index:$prev_index})<-[:CREATES]-(:transaction {id:$prev_tx}) \"\n",
    "                            \"MERGE (tx_in)<-[r:SPENDS {script_sig:$script_sig, witness:$witness}]-(t) \"\n",
    "                            \"RETURN r\",\n",
    "                            tx_id=tx_id, prev_index=tx_in.prev_index, prev_tx=tx_in.prev_tx.hex(), \n",
    "                            script_sig=str(tx_in.script_sig), witness=tx_in.witness.hex() )\n",
    "                if len(result.data()) > 0: app_log.info(f\"created input: {result.data()}\")\n",
    "                else: app_log.error(f\"FAILED AT CREATING INPUT {tx_in.prev_tx}:{tx_in.prev_index}\")  \n",
    "\n",
    "        return True\n",
    "    \n",
    "    @staticmethod\n",
    "    def _new_block(tx,block_id,version, prev_block,merkle_root,timestamp,bits,nonce,n_tx):\n",
    "        #_height = tx.run( \"MATCH (u:block) RETURN COUNT (u) \").single()[0] \n",
    "        #pblock = tx.run(\"MATCH (prev_block:block {id:$prev_block}) RETURN prev_block\", prev_block=prev_block)\n",
    "        #if not pblock.single():\n",
    "         #   print(f\"COULD NOT FIND PREVIOUS BLOCK {prev_block}.\")\n",
    "        result = tx.run(\"MERGE (block:block {id:$block_id}) \"\n",
    "                        \"SET block.n_tx=$n_tx, block.nonce=$nonce, block.merkle_root=$merkle_root, block.bits=$bits, block.timestamp=$timestamp, block.version=$version \"\n",
    "                        \"MERGE (prevblock:block {id:$prev_block}) \"\n",
    "                        \"MERGE (block)<-[:chain]-(prevblock) \"\n",
    "                        \"RETURN block \",\n",
    "                        block_id=block_id, version=version, prev_block=prev_block, merkle_root=merkle_root, timestamp=timestamp, \n",
    "                        bits=bits, nonce=nonce, n_tx=n_tx)\n",
    "        return result.data()\n",
    "\n",
    "    def new_address(self, address,i,change_addr):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.write_transaction(self._new_address, address,i,change_addr)\n",
    "            print(result)\n",
    "            \n",
    "    def new_tx(self, block_id, version, locktime, tx_id, inputs, outputs, segwit,i):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.write_transaction(self._new_tx, block_id, version, locktime, tx_id, inputs, outputs, segwit,i)\n",
    "                  \n",
    "    def new_block(self,block_id,version, prev_block,merkle_root,timestamp,bits,nonce,n_tx):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.write_transaction(self._new_block,block_id,version, prev_block,merkle_root,timestamp,bits,nonce,n_tx)\n",
    "            if len(result) >0: app_log.info(f\"CREATED BLOCK {block_id}\")\n",
    "            else: app_log.error(f\"FAILED AT CREATING BLOCK {block_id}\")\n",
    "            #print(result)\n",
    "  \n",
    "      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_cursor(file):\n",
    "    c = 0\n",
    "    print(f\"checking for cursors {file}\")\n",
    "    try:\n",
    "        cursor = open(f\"cursors/cursor{file}.txt\")\n",
    "        c = cursor.readline()\n",
    "        try:\n",
    "            c = int(c)\n",
    "            print(f\"cursor at {c}\")\n",
    "            coursor.close()\n",
    "            return c\n",
    "        except:\n",
    "            if c == \"finished\":\n",
    "                print(c)\n",
    "                return True\n",
    "            else:\n",
    "                try: \n",
    "                    print(\"trying to recover file from backup.\")\n",
    "                    cursor = open(f\"{file[:-4]}.txt.bck\")\n",
    "                    c = coursor.readline()\n",
    "                    try:\n",
    "                        c = int(c)\n",
    "                        subprocess.call(f\" cp cursors/cursor{file}.txt.bck cursors/cursor{file}.txt\", shell=True)\n",
    "                        print(\"succesfully recovered file from backup. Restored original file.\")\n",
    "                        coursor.close()\n",
    "                        return c\n",
    "                    except:\n",
    "                        if c == \"finished\":\n",
    "                            coursor.close()\n",
    "                            print(c)\n",
    "                            subprocess.call(f\" cp cursors/cursor{file}.txt.bck cursors/cursor{file}.txt\",shell=True)\n",
    "                            print(\"Finished. Succesfully updated original file.\")\n",
    "                            return c\n",
    "                        else:\n",
    "                            print(\"Corrupted cursor files.\")\n",
    "                            raise Exception\n",
    "\n",
    "                except:\n",
    "                    print(\"No back-up file.\")\n",
    "                    raise Exception\n",
    "       \n",
    "\n",
    "    except:\n",
    "        cursor  = open(f\"cursors/cursor{file}.txt\",\"w\")\n",
    "        print(\"No cursor file\")\n",
    "        cursor.write(str(c))\n",
    "        print(c)\n",
    "        cursor.close()\n",
    "        return c\n",
    "\n",
    "def parse_blockchain(args):\n",
    "    file = f\"blocks_demo/blk{args[0]}.dat\"\n",
    "    db=args[1]\n",
    "    print(f\"parsing {file}\")\n",
    "    #print(f\"driver {db}\")\n",
    "    \n",
    "    with open(file,\"rb\") as block_file:\n",
    "        print(f\"opened {file}\")\n",
    "        c = get_cursor(args[0])\n",
    "        if c !=0: \n",
    "            print(f\"reading from {c}\")\n",
    "            block_file.read(c)\n",
    "        \n",
    "        while True:\n",
    "\n",
    "            try:\n",
    "                this_block = Block.parse_from_blk(block_file)\n",
    "\n",
    "                header = this_block.version.to_bytes(4,\"little\")+this_block.prev_block[::-1]+this_block.merkle_root[::-1]+this_block.timestamp.to_bytes(4,\"little\") + this_block.bits + this_block.nonce\n",
    "                block_id = hash256(header)[::-1]\n",
    "\n",
    "                db.new_block(block_id.hex(),this_block.version, this_block.prev_block.hex(), \n",
    "                             this_block.merkle_root.hex(),this_block.timestamp, \n",
    "                             int.from_bytes(this_block.bits,\"big\"), \n",
    "                             int.from_bytes(this_block.nonce,\"big\"),\n",
    "                             this_block.tx_hashes)\n",
    "\n",
    "                for transaction in range(this_block.tx_hashes):\n",
    "                    tx = Tx.parse(block_file)\n",
    "                    db.new_tx(block_id.hex(), tx.version, tx.locktime, tx.id(), tx.tx_ins, tx.tx_outs, tx.segwit,transaction)\n",
    "\n",
    "                c += (this_block.size + 8)\n",
    "                #print(c)\n",
    "                cursor  = open(f\"cursors/cursor{args[0]}.txt\",\"w\")\n",
    "                cursor.write(str(c))\n",
    "                cursor.close()\n",
    "                cursor  = open(f\"cursors/cursor{args[0]}.txt.bck\",\"w\")\n",
    "                cursor.write(str(c))\n",
    "                cursor.close()\n",
    "                \n",
    "                \n",
    "            except Exception as e:\n",
    "                print(f\"Finished {file} file. \")\n",
    "                print(e)\n",
    "                print(e.with_traceback)\n",
    "                break\n",
    "      \n",
    "\n",
    "    \n",
    " "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def main(args):\n",
    "    n_threads = args[1]\n",
    "    n = args[0]\n",
    "    #db = BlockChainDB(driver = args[2])\n",
    "    db = BlockChainDB(\"neo4j://localhost:7687\", \"neo4j\", \"wallet\")\n",
    "    file_list = [(f\"{i:05}\",db) for i in range( n , n + n_threads )]\n",
    "    with concurrent.futures.ThreadPoolExecutor(max_workers=n_threads) as executor:\n",
    "        executor.map(parse_blockchain, file_list)   \n",
    "    return True\n",
    "        \n",
    "def super_main(start_at,n_processes,n_threads):\n",
    "    #driver = GraphDatabase.driver(\"neo4j://localhost:7687\", auth=(\"neo4j\", \"wallet\"), encrypted=False)\n",
    "    batch_list = [start_at+n_threads*i for i in range(n_processes)]\n",
    "    arg_list = [(n,n_threads) for n in batch_list]\n",
    "    with Pool(n_processes) as p:\n",
    "        p.map(main, arg_list)\n",
    "    \n",
    "def manager(total_files, n_processes, n_threads, n_nodes):\n",
    "    concurrent_files = n_processes*n_threads\n",
    "    batches = total_files//concurrent_files+1\n",
    "    batch_list = [concurrent_files*i for i in range(batches)]\n",
    "    print(f\"batch_list {batch_list}\")\n",
    "    for index,batch in enumerate(batch_list):\n",
    "        node = index%n_nodes\n",
    "        print(f\"node {node} batch {batch}\")\n",
    "        super_main(batch, n_processes, n_threads)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "batch_list [0, 8]\n",
      "node 0 batch 0\n",
      "parsing blocks_demo/blk00006.dat\n",
      "parsing blocks_demo/blk00004.dat\n",
      "parsing blocks_demo/blk00005.dat\n",
      "parsing blocks_demo/blk00000.dat\n",
      "parsing blocks_demo/blk00001.dat\n",
      "parsing blocks_demo/blk00007.dat\n",
      "opened blocks_demo/blk00000.dat\n",
      "opened blocks_demo/blk00004.dat\n",
      "opened blocks_demo/blk00007.dat\n",
      "opened blocks_demo/blk00005.dat\n",
      "checking for cursors 00000\n",
      "checking for cursors 00004\n",
      "opened blocks_demo/blk00006.dat\n",
      "opened blocks_demo/blk00001.dat\n",
      "checking for cursors 00005\n",
      "checking for cursors 00006\n",
      "parsing blocks_demo/blk00002.dat\n",
      "cursor at 27417332\n",
      "checking for cursors 00007\n",
      "cursor at 75195\n",
      "checking for cursors 00001\n",
      "parsing blocks_demo/blk00003.dat\n",
      "opened blocks_demo/blk00002.dat\n",
      "cursor at 66491\n",
      "cursor at 43942\n",
      "trying to recover file from backup.\n",
      "opened blocks_demo/blk00003.dat\n",
      "cursor at 70919\n",
      "trying to recover file from backup.\n",
      "cursor at 25418670\n",
      "checking for cursors 00002\n",
      "trying to recover file from backup.\n",
      "checking for cursors 00003\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "trying to recover file from backup.\n",
      "cursor at 24567888\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "cursor at 62048\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "No back-up file.\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "No back-up file.\n",
      "No cursor file\n",
      "75195\n",
      "25418670\n",
      "66491\n",
      "27417332\n",
      "No cursor file\n",
      "No cursor file\n",
      "43942\n",
      "70919\n",
      "reading from 75195\n",
      "24567888\n",
      "reading from 25418670\n",
      "reading from 66491\n",
      "reading from 43942\n",
      "reading from 27417332\n",
      "62048\n",
      "reading from 70919\n",
      "reading from 24567888\n",
      "reading from 62048\n",
      "Finished blocks_demo/blk00006.dat file. \n",
      "parsing script failed\n",
      "<built-in method with_traceback of SyntaxError object at 0x106c03ae8>\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Process ForkPoolWorker-19:\n",
      "Process ForkPoolWorker-18:\n",
      "Process ForkPoolWorker-20:\n",
      "Process ForkPoolWorker-17:\n",
      "Traceback (most recent call last):\n",
      "Traceback (most recent call last):\n",
      "Traceback (most recent call last):\n",
      "Traceback (most recent call last):\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 297, in _bootstrap\n",
      "    self.run()\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 297, in _bootstrap\n",
      "    self.run()\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 297, in _bootstrap\n",
      "    self.run()\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 297, in _bootstrap\n",
      "    self.run()\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 99, in run\n",
      "    self._target(*self._args, **self._kwargs)\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 99, in run\n",
      "    self._target(*self._args, **self._kwargs)\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 99, in run\n",
      "    self._target(*self._args, **self._kwargs)\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/process.py\", line 99, in run\n",
      "    self._target(*self._args, **self._kwargs)\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 121, in worker\n",
      "    result = (True, func(*args, **kwds))\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 121, in worker\n",
      "    result = (True, func(*args, **kwds))\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 121, in worker\n",
      "    result = (True, func(*args, **kwds))\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 121, in worker\n",
      "    result = (True, func(*args, **kwds))\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 44, in mapstar\n",
      "    return list(map(*args))\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 44, in mapstar\n",
      "    return list(map(*args))\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 44, in mapstar\n",
      "    return list(map(*args))\n",
      "  File \"/anaconda3/lib/python3.7/multiprocessing/pool.py\", line 44, in mapstar\n",
      "    return list(map(*args))\n",
      "  File \"<ipython-input-19-c60f2df631c8>\", line 8, in main\n",
      "    executor.map(parse_blockchain, file_list)\n",
      "  File \"<ipython-input-19-c60f2df631c8>\", line 8, in main\n",
      "    executor.map(parse_blockchain, file_list)\n",
      "  File \"<ipython-input-19-c60f2df631c8>\", line 8, in main\n",
      "    executor.map(parse_blockchain, file_list)\n",
      "  File \"<ipython-input-19-c60f2df631c8>\", line 8, in main\n",
      "    executor.map(parse_blockchain, file_list)\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/_base.py\", line 611, in __exit__\n",
      "    self.shutdown(wait=True)\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/_base.py\", line 611, in __exit__\n",
      "    self.shutdown(wait=True)\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/_base.py\", line 611, in __exit__\n",
      "    self.shutdown(wait=True)\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/_base.py\", line 611, in __exit__\n",
      "    self.shutdown(wait=True)\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/thread.py\", line 204, in shutdown\n",
      "    t.join()\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/thread.py\", line 204, in shutdown\n",
      "    t.join()\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/thread.py\", line 204, in shutdown\n",
      "    t.join()\n",
      "  File \"/anaconda3/lib/python3.7/concurrent/futures/thread.py\", line 204, in shutdown\n",
      "    t.join()\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1032, in join\n",
      "    self._wait_for_tstate_lock()\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1032, in join\n",
      "    self._wait_for_tstate_lock()\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1032, in join\n",
      "    self._wait_for_tstate_lock()\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1032, in join\n",
      "    self._wait_for_tstate_lock()\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1048, in _wait_for_tstate_lock\n",
      "    elif lock.acquire(block, timeout):\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1048, in _wait_for_tstate_lock\n",
      "    elif lock.acquire(block, timeout):\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1048, in _wait_for_tstate_lock\n",
      "    elif lock.acquire(block, timeout):\n",
      "  File \"/anaconda3/lib/python3.7/threading.py\", line 1048, in _wait_for_tstate_lock\n",
      "    elif lock.acquire(block, timeout):\n",
      "KeyboardInterrupt\n",
      "KeyboardInterrupt\n",
      "KeyboardInterrupt\n",
      "KeyboardInterrupt\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-20-d23e9d5f5fdf>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mmanager\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m10\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m4\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;36m2\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m<ipython-input-19-c60f2df631c8>\u001b[0m in \u001b[0;36mmanager\u001b[0;34m(total_files, n_processes, n_threads, n_nodes)\u001b[0m\n\u001b[1;32m     24\u001b[0m         \u001b[0mnode\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mindex\u001b[0m\u001b[0;34m%\u001b[0m\u001b[0mn_nodes\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     25\u001b[0m         \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34mf\"node {node} batch {batch}\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 26\u001b[0;31m         \u001b[0msuper_main\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbatch\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mn_processes\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mn_threads\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m<ipython-input-19-c60f2df631c8>\u001b[0m in \u001b[0;36msuper_main\u001b[0;34m(start_at, n_processes, n_threads)\u001b[0m\n\u001b[1;32m     14\u001b[0m     \u001b[0marg_list\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m[\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mn\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0mn_threads\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mfor\u001b[0m \u001b[0mn\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mbatch_list\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     15\u001b[0m     \u001b[0;32mwith\u001b[0m \u001b[0mPool\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mn_processes\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mp\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 16\u001b[0;31m         \u001b[0mp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmap\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmain\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0marg_list\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     17\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     18\u001b[0m \u001b[0;32mdef\u001b[0m \u001b[0mmanager\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtotal_files\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mn_processes\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mn_threads\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mn_nodes\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/multiprocessing/pool.py\u001b[0m in \u001b[0;36mmap\u001b[0;34m(self, func, iterable, chunksize)\u001b[0m\n\u001b[1;32m    266\u001b[0m         \u001b[0;32min\u001b[0m \u001b[0ma\u001b[0m \u001b[0mlist\u001b[0m \u001b[0mthat\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0mreturned\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    267\u001b[0m         '''\n\u001b[0;32m--> 268\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_map_async\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfunc\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0miterable\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmapstar\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mchunksize\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    269\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    270\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mstarmap\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0miterable\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mchunksize\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/multiprocessing/pool.py\u001b[0m in \u001b[0;36mget\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    649\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    650\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 651\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwait\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    652\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mready\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    653\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mTimeoutError\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/multiprocessing/pool.py\u001b[0m in \u001b[0;36mwait\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    646\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    647\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mwait\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 648\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_event\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwait\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    649\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    650\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/threading.py\u001b[0m in \u001b[0;36mwait\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    550\u001b[0m             \u001b[0msignaled\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_flag\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    551\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0msignaled\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 552\u001b[0;31m                 \u001b[0msignaled\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_cond\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwait\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    553\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0msignaled\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    554\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/threading.py\u001b[0m in \u001b[0;36mwait\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    294\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m    \u001b[0;31m# restore state no matter what (e.g., KeyboardInterrupt)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    295\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mtimeout\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 296\u001b[0;31m                 \u001b[0mwaiter\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0macquire\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    297\u001b[0m                 \u001b[0mgotit\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    298\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "manager(10, 4,2,1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "parsing blocks_demo/blk00000.dat\n",
      "parsing blocks_demo/blk00001.dat\n",
      "opened blocks_demo/blk00000.dat\n",
      "checking for cursors 00000\n",
      "parsing blocks_demo/blk00002.dat\n",
      "opened blocks_demo/blk00001.dat\n",
      "checking for cursors 00001\n",
      "No cursor file\n",
      "0\n",
      "No cursor fileopened blocks_demo/blk00002.dat\n",
      "checking for cursors 00002\n",
      "\n",
      "0\n",
      "No cursor file\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "main()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# The Idea For The RPi Cluster\n",
    "\n",
    "Since python can only manage one process, we would have to manage the script from outside python. In other words, we will have to call the python script 4 times from a bash script in order for them to start in an independent process, and in this way utilize the 4 cores of the raspberry pi. Each one of the four scripts will be assigned a different blk\\*\\*\\*\\*\\*.dat file to parallelize the parsing. If this works, this will mean that the cluster will be able to parse 16 files at the same time.\n",
    "\n",
    "To Do/Fix:\n",
    "1. Skip the Script op_codes parsing on the ScriptPubKey and ScripSig. This will be done separetely if necessary, but for efficiency reasons, the database will store these fields as hexadecimals without any validation since this is also unnecessary. This will fix the app crashing on ScriptSig for coinbase transactions where the scripts are abitrary.\n",
    "2. Create the bash script that will assign a different file to the python script.\n",
    "3. Create the file sharing system for the blocks and the database.\n",
    "4. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.chdir(\"/Users/oscareduardosernarosero/Desktop/neo4j-community-4.0.3/bin\")\n",
    "whereami = subprocess.check_output(\"pwd\")\n",
    "print(whereami)\n",
    "if whereami == b\"/Users/oscareduardosernarosero/Desktop/neo4j-community-4.0.3/bin\\n\": print(\"ok\")\n",
    "print(subprocess.check_output(\"ls\"))\n",
    "start_neo4j = subprocess.check_output(\"./neo4j start\",shell = True)\n",
    "if \"Started neo4j\" in str(start_neo4j): print(\"Sarted Neo4j successfully...\")\n",
    "else: print(\"Failed starting Neo4j.\")\n",
    "sleep(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "ename": "CalledProcessError",
     "evalue": "Command 'MATCH (n) RETURN n' returned non-zero exit status 2.",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mCalledProcessError\u001b[0m                        Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-57-f2f54fa574f5>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0;31m#output = Popen([\"./cypher-shell\",\"-u\",\"neo4j\",\"-p\",\"wallet\"],stdout=PIPE, stderr=PIPE)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0msubprocess\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcall\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"./cypher-shell -u neo4j -p wallet\"\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0mshell\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 4\u001b[0;31m \u001b[0moutput\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msubprocess\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcheck_output\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"MATCH (n) RETURN n\"\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0mshell\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      5\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0moutput\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/subprocess.py\u001b[0m in \u001b[0;36mcheck_output\u001b[0;34m(timeout, *popenargs, **kwargs)\u001b[0m\n\u001b[1;32m    393\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    394\u001b[0m     return run(*popenargs, stdout=PIPE, timeout=timeout, check=True,\n\u001b[0;32m--> 395\u001b[0;31m                **kwargs).stdout\n\u001b[0m\u001b[1;32m    396\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    397\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/subprocess.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(input, capture_output, timeout, check, *popenargs, **kwargs)\u001b[0m\n\u001b[1;32m    485\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcheck\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0mretcode\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    486\u001b[0m             raise CalledProcessError(retcode, process.args,\n\u001b[0;32m--> 487\u001b[0;31m                                      output=stdout, stderr=stderr)\n\u001b[0m\u001b[1;32m    488\u001b[0m     \u001b[0;32mreturn\u001b[0m \u001b[0mCompletedProcess\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocess\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mretcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstdout\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstderr\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    489\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mCalledProcessError\u001b[0m: Command 'MATCH (n) RETURN n' returned non-zero exit status 2."
     ]
    }
   ],
   "source": [
    "#os.chdir(\"/Users/oscareduardosernarosero/Desktop/neo4j-community-4.0.3/bin\")\n",
    "#output = Popen([\"./cypher-shell\",\"-u\",\"neo4j\",\"-p\",\"wallet\"],stdout=PIPE, stderr=PIPE)\n",
    "subprocess.call(\"./cypher-shell -u neo4j -p wallet\",shell = True)\n",
    "output = subprocess.check_output(\"MATCH (n) RETURN n\",shell = True)\n",
    "print(output)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b''\n"
     ]
    }
   ],
   "source": [
    "stdout, stderr = output.communicate(\"\\tMATCH (n) RETURN n\\n\")\n",
    "print (stdout)\n",
    "#subprocess.call(\"neo4j\",shell = True)\n",
    "#sleep(2)\n",
    "#loggedin = subprocess.check_output(\"wallet\",shell = True)\n",
    "#if \"Connected to Neo4j 4.0.3 at neo4j://localhost:7687 as user neo4j\" in str(loggedin):print(\"connected\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b\"\\xf9\\xbe\\xb4\\xd9\\x1d\\x01\\x00\\x00\\x01\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00;\\xa3\\xed\\xfdz{\\x12\\xb2z\\xc7,>gv\\x8fa\\x7f\\xc8\\x1b\\xc3\\x88\\x8aQ2:\\x9f\\xb8\\xaaK\\x1e^J)\\xab_I\\xff\\xff\\x00\\x1d\\x1d\\xac+|\\x01\\x01\\x00\\x00\\x00\\x01\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\xff\\xff\\xff\\xffM\\x04\\xff\\xff\\x00\\x1d\\x01\\x04EThe Times 03/Jan/2009 Chancellor on brink of second bailout for banks\\xff\\xff\\xff\\xff\\x01\\x00\\xf2\\x05*\\x01\\x00\\x00\\x00CA\\x04g\\x8a\\xfd\\xb0\\xfeUH'\\x19g\\xf1\\xa6q0\\xb7\\x10\\\\\\xd6\\xa8(\\xe09\\t\\xa6yb\\xe0\\xea\\x1fa\\xde\\xb6I\\xf6\\xbc?L\\xef8\\xc4\\xf3U\\x04\\xe5\\x1e\\xc1\\x12\\xde\\\\8M\\xf7\\xba\\x0b\\x8dW\\x8aLp+k\\xf1\\x1d_\\xac\\x00\\x00\\x00\\x00\\xf9\\xbe\\xb4\\xd9\"\n"
     ]
    }
   ],
   "source": [
    "with open(\"blocks_demo/blk00000.dat\",\"rb\") as block_file:\n",
    "    \n",
    "    print(block_file.read(297))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'0x14'"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "hex(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.chdir(\"block_demo\")\n",
    "files = subprocess.check_output(\"ls\")\n",
    "files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f\n",
      "000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f 1 0000000000000000000000000000000000000000000000000000000000000000 4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b 1231006505 4294901789 497822588 1\n",
      "tx: 4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b\n",
      "version: 1\n",
      "tx_ins:\n",
      "0000000000000000000000000000000000000000000000000000000000000000:4294967295\n",
      "tx_outs:\n",
      "5000000000:04678afdb0fe5548271967f1a67130b7105cd6a828e03909a67962e0ea1f61deb649f6bc3f4cef38c4f35504e51ec112de5c384df7ba0b8d578a4c702b6bf11d5f OP_CHECKSIG\n",
      "locktime: 0\n",
      "b'The Times 03/Jan/2009 Chancellor on brink of second bailout for banks'\n"
     ]
    }
   ],
   "source": [
    "with open(\"blocks_demo/blk00000.dat\",\"rb\") as block_file:\n",
    "    #block_file.read(43942)\n",
    "    \n",
    "    this_block = Block.parse_from_blk(block_file)\n",
    "\n",
    "    header = this_block.version.to_bytes(4,\"little\")+this_block.prev_block[::-1]+this_block.merkle_root[::-1]+this_block.timestamp.to_bytes(4,\"little\") + this_block.bits + this_block.nonce\n",
    "    block_id = hash256(header)[::-1]\n",
    "    print(block_id.hex())\n",
    "\n",
    "    print(block_id.hex(),this_block.version, this_block.prev_block.hex(), \n",
    "                 this_block.merkle_root.hex(),this_block.timestamp, \n",
    "                 int.from_bytes(this_block.bits,\"big\"), \n",
    "                 int.from_bytes(this_block.nonce,\"big\"),\n",
    "                 this_block.tx_hashes)\n",
    "   \n",
    "    for transaction in range(this_block.tx_hashes):\n",
    "        tx = Tx.parse(block_file)\n",
    "        print(tx)\n",
    "        print(tx.tx_ins[0].script_sig.cmds[2])\n",
    "        #db.new_tx(block_id.hex(), tx.version, tx.locktime, tx.id(), tx.tx_ins, tx.tx_outs, tx.segwit,transaction)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
