{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import binascii\n",
    "import sys\n",
    "import traceback\n",
    "from block import Block\n",
    "from helper import read_varint, hash256\n",
    "from tx import Tx\n",
    "import subprocess\n",
    "import os\n",
    "from time import sleep\n",
    "from subprocess import Popen, PIPE\n",
    "import logging\n",
    "import concurrent.futures\n",
    "from multiprocessing import Pool\n",
    "#logging.basicConfig(filename='parsing.log',level=logging.DEBUG,format='%(asctime)s %(message)s')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from logging.handlers import RotatingFileHandler\n",
    "\n",
    "log_formatter = logging.Formatter('%(asctime)s %(levelname)s %(funcName)s(%(lineno)d) %(message)s')\n",
    "\n",
    "logFile = 'log/parsing.log'\n",
    "\n",
    "my_handler = RotatingFileHandler(logFile, mode='a', maxBytes=10*1024*1024,backupCount=6, encoding=None, delay=0)\n",
    "my_handler.setFormatter(log_formatter)\n",
    "my_handler.setLevel(logging.INFO)\n",
    "\n",
    "app_log = logging.getLogger('root')\n",
    "app_log.setLevel(logging.INFO)\n",
    "\n",
    "app_log.addHandler(my_handler)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "class BlockChainDB(object):\n",
    "\n",
    "    def __init__(self, uri, user, password):\n",
    "        self._driver = GraphDatabase.driver(uri, auth=(user, password), encrypted=False)#REVISE LATER FOR ENCRYPTION!!!\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "        \n",
    "        \n",
    "    @staticmethod\n",
    "    def _new_address(tx, address,i,change_addr):\n",
    "        if change_addr: addr_type = \"change\"\n",
    "        else: addr_type = \"recipient\"\n",
    "        result = tx.run(\"CREATE a = (:address {address:$address, acc_index:$index, type:$kind, created:timestamp()}) \"\n",
    "                        \"RETURN a \", address=address, index = i, kind = addr_type)\n",
    "        return result.single()\n",
    "    \n",
    "    \n",
    "    @staticmethod\n",
    "    def _new_tx(tx,block_id, version, locktime, tx_id, inputs, outputs, segwit, i):\n",
    "                    \n",
    "        result = tx.run(\"MATCH (b:block {id:$block_id}) \"\n",
    "                        \"MERGE (t:transaction {id:$tx_id}) \"\n",
    "                        \"SET t.version=$version, t.segwit=$segwit, t.locktime=$locktime \"\n",
    "                        \"MERGE (t)<-[:CONTAINS {i:$i}]-(b) \"\n",
    "                        \"RETURN t \",\n",
    "                        tx_id=tx_id, segwit=segwit, version=version, locktime=locktime, block_id=block_id,i=i)\n",
    "        \n",
    "        if len(result.data()) >0: app_log.info(f\"created tx: {tx_id}\\n{result.data()}\")\n",
    "        else: app_log.error(f\"FAILED AT CREATING TX {tx_id}\")\n",
    "        \n",
    "        for index,tx_out in enumerate(outputs):\n",
    "            result = tx.run(\"MATCH (t:transaction {id : $tx_id}) \"\n",
    "                        \"MERGE (o:output {index:$index})<-[:CREATES]-(t) \"\n",
    "                        \"SET o.amount=$amount, o.script_pubkey=$script_pubkey \"\n",
    "                        \"RETURN o \", \n",
    "                        tx_id = tx_id,amount=tx_out.amount,script_pubkey=str(tx_out.script_pubkey), index=index)\n",
    "            if len(result.data()) > 0: app_log.info(f\"created output: {tx_out.amount}:{index} for tx {tx_id}\")\n",
    "            else: app_log.error(f\"FAILED AT CREATING OUTPUT {index}\")  \n",
    "                \n",
    "        for tx_in in inputs:\n",
    "            if tx_in.prev_index == 4294967295 or tx_in.prev_tx == (b'\\x00'*32).hex():\n",
    "                    app_log.info(\"Coinbase Transaction \" + tx_id)\n",
    "            else: \n",
    "                result = tx.run(\"MERGE (t:transaction {id : $tx_id}) \"\n",
    "                            #\"MERGE (p:transaction {id:$prev_tx})\"\n",
    "                            \"MERGE (tx_in :output {index:$prev_index})<-[:CREATES]-(:transaction {id:$prev_tx}) \"\n",
    "                            \"MERGE (tx_in)<-[r:SPENDS {script_sig:$script_sig, witness:$witness}]-(t) \"\n",
    "                            \"RETURN r\",\n",
    "                            tx_id=tx_id, prev_index=tx_in.prev_index, prev_tx=tx_in.prev_tx.hex(), \n",
    "                            script_sig=str(tx_in.script_sig), witness=tx_in.witness.hex() )\n",
    "                if len(result.data()) > 0: app_log.info(f\"created input: {result.data()}\")\n",
    "                else: app_log.error(f\"FAILED AT CREATING INPUT {tx_in.prev_tx}:{tx_in.prev_index}\")  \n",
    "\n",
    "        return True\n",
    "    \n",
    "    @staticmethod\n",
    "    def _new_block(tx,block_id,version, prev_block,merkle_root,timestamp,bits,nonce,n_tx):\n",
    "        #_height = tx.run( \"MATCH (u:block) RETURN COUNT (u) \").single()[0] \n",
    "        #pblock = tx.run(\"MATCH (prev_block:block {id:$prev_block}) RETURN prev_block\", prev_block=prev_block)\n",
    "        #if not pblock.single():\n",
    "         #   print(f\"COULD NOT FIND PREVIOUS BLOCK {prev_block}.\")\n",
    "        result = tx.run(\"MERGE (block:block {id:$block_id}) \"\n",
    "                        \"SET block.n_tx=$n_tx, block.nonce=$nonce, block.merkle_root=$merkle_root, block.bits=$bits, block.timestamp=$timestamp, block.version=$version \"\n",
    "                        \"MERGE (prevblock:block {id:$prev_block}) \"\n",
    "                        \"MERGE (block)<-[:chain]-(prevblock) \"\n",
    "                        \"RETURN block \",\n",
    "                        block_id=block_id, version=version, prev_block=prev_block, merkle_root=merkle_root, timestamp=timestamp, \n",
    "                        bits=bits, nonce=nonce, n_tx=n_tx)\n",
    "        return result.data()\n",
    "\n",
    "    def new_address(self, address,i,change_addr):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.write_transaction(self._new_address, address,i,change_addr)\n",
    "            print(result)\n",
    "            \n",
    "    def new_tx(self, block_id, version, locktime, tx_id, inputs, outputs, segwit,i):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.write_transaction(self._new_tx, block_id, version, locktime, tx_id, inputs, outputs, segwit,i)\n",
    "                  \n",
    "    def new_block(self,block_id,version, prev_block,merkle_root,timestamp,bits,nonce,n_tx):\n",
    "        with self._driver.session() as session:\n",
    "            result = session.write_transaction(self._new_block,block_id,version, prev_block,merkle_root,timestamp,bits,nonce,n_tx)\n",
    "            if len(result) >0: app_log.info(f\"CREATED BLOCK {block_id}\")\n",
    "            else: app_log.error(f\"FAILED AT CREATING BLOCK {block_id}\")\n",
    "            #print(result)\n",
    "  \n",
    "      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_cursor(file):\n",
    "    c = 0\n",
    "    print(f\"checking for cursors {file}\")\n",
    "    try:\n",
    "        cursor = open(f\"cursors/cursor{file}.txt\")\n",
    "        c = cursor.readline()\n",
    "        try:\n",
    "            c = int(c)\n",
    "            print(f\"cursor at {c}\")\n",
    "            coursor.close()\n",
    "            return c\n",
    "        except:\n",
    "            if c == \"finished\":\n",
    "                print(c)\n",
    "                return True\n",
    "            else:\n",
    "                try: \n",
    "                    print(\"trying to recover file from backup.\")\n",
    "                    cursor = open(f\"{file[:-4]}.txt.bck\")\n",
    "                    c = coursor.readline()\n",
    "                    try:\n",
    "                        c = int(c)\n",
    "                        subprocess.call(f\" cp cursors/cursor{file}.txt.bck cursors/cursor{file}.txt\", shell=True)\n",
    "                        print(\"succesfully recovered file from backup. Restored original file.\")\n",
    "                        coursor.close()\n",
    "                        return c\n",
    "                    except:\n",
    "                        if c == \"finished\":\n",
    "                            coursor.close()\n",
    "                            print(c)\n",
    "                            subprocess.call(f\" cp cursors/cursor{file}.txt.bck cursors/cursor{file}.txt\",shell=True)\n",
    "                            print(\"Finished. Succesfully updated original file.\")\n",
    "                            return c\n",
    "                        else:\n",
    "                            print(\"Corrupted cursor files.\")\n",
    "                            raise Exception\n",
    "\n",
    "                except:\n",
    "                    print(\"No back-up file.\")\n",
    "                    raise Exception\n",
    "       \n",
    "\n",
    "    except:\n",
    "        cursor  = open(f\"cursors/cursor{file}.txt\",\"w\")\n",
    "        print(\"No cursor file\")\n",
    "        cursor.write(str(c))\n",
    "        print(c)\n",
    "        cursor.close()\n",
    "        return c\n",
    "\n",
    "def parse_blockchain(args):\n",
    "    file = f\"blocks_demo/blk{args[0]}.dat\"\n",
    "    db=args[1]\n",
    "    print(f\"parsing {file}\")\n",
    "    #print(f\"driver {db}\")\n",
    "    \n",
    "    with open(file,\"rb\") as block_file:\n",
    "        print(f\"opened {file}\")\n",
    "        c = get_cursor(args[0])\n",
    "        if c !=0: \n",
    "            print(f\"reading from {c}\")\n",
    "            block_file.read(c)\n",
    "        \n",
    "        while True:\n",
    "\n",
    "            try:\n",
    "                this_block = Block.parse_from_blk(block_file)\n",
    "\n",
    "                header = this_block.version.to_bytes(4,\"little\")+this_block.prev_block[::-1]+this_block.merkle_root[::-1]+this_block.timestamp.to_bytes(4,\"little\") + this_block.bits + this_block.nonce\n",
    "                block_id = hash256(header)[::-1]\n",
    "\n",
    "                db.new_block(block_id.hex(),this_block.version, this_block.prev_block.hex(), \n",
    "                             this_block.merkle_root.hex(),this_block.timestamp, \n",
    "                             int.from_bytes(this_block.bits,\"big\"), \n",
    "                             int.from_bytes(this_block.nonce,\"big\"),\n",
    "                             this_block.tx_hashes)\n",
    "\n",
    "                for transaction in range(this_block.tx_hashes):\n",
    "                    tx = Tx.parse(block_file)\n",
    "                    db.new_tx(block_id.hex(), tx.version, tx.locktime, tx.id(), tx.tx_ins, tx.tx_outs, tx.segwit,transaction)\n",
    "\n",
    "                c += (this_block.size + 8)\n",
    "                #print(c)\n",
    "                cursor  = open(f\"cursors/cursor{args[0]}.txt\",\"w\")\n",
    "                cursor.write(str(c))\n",
    "                cursor.close()\n",
    "                cursor  = open(f\"cursors/cursor{args[0]}.txt.bck\",\"w\")\n",
    "                cursor.write(str(c))\n",
    "                cursor.close()\n",
    "                \n",
    "                \n",
    "            except Exception as e:\n",
    "                print(f\"Finished {file} file. \")\n",
    "                print(e)\n",
    "                print(e.with_traceback)\n",
    "                break\n",
    "      \n",
    "\n",
    "    \n",
    " "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def main(args):\n",
    "    n_threads = args[1]\n",
    "    n = args[0]\n",
    "    db = BlockChainDB( \"neo4j://localhost:7687\" ,\"neo4j\" ,\"wallet\" )\n",
    "    file_list = [(f\"{i:05}\",db) for i in range( n , n + n_threads )]\n",
    "    with concurrent.futures.ThreadPoolExecutor(max_workers=n_threads) as executor:\n",
    "        executor.map(parse_blockchain, file_list)   \n",
    "    return True\n",
    "        \n",
    "def super_main(start_at,n_processes,n_threads):\n",
    "    batch_list = [start_at+n_threads*i for i in range(n_processes)]\n",
    "    arg_list = [(n,n_threads) for n in batch_list]\n",
    "    with Pool(n_processes) as p:\n",
    "        p.map(main, arg_list)\n",
    "    \n",
    "def manager(total_files, n_processes, n_threads, n_nodes):\n",
    "    concurrent_files = n_processes*n_threads\n",
    "    batches = total_files//concurrent_files+1\n",
    "    batch_list = [concurrent_files*i for i in range(batches)]\n",
    "    print(f\"batch_list {batch_list}\")\n",
    "    for index,batch in enumerate(batch_list):\n",
    "        node = index%n_nodes\n",
    "        print(f\"node {node} batch {batch}\")\n",
    "        super_main(batch, n_processes, n_threads)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "batch_list [0, 8]\n",
      "node 0 batch 0\n",
      "parsing blocks_demo/blk00004.dat\n",
      "parsing blocks_demo/blk00000.dat\n",
      "parsing blocks_demo/blk00002.dat\n",
      "parsing blocks_demo/blk00001.dat\n",
      "parsing blocks_demo/blk00006.dat\n",
      "parsing blocks_demo/blk00005.dat\n",
      "parsing blocks_demo/blk00003.dat\n",
      "parsing blocks_demo/blk00007.dat\n",
      "opened blocks_demo/blk00006.dat\n",
      "opened blocks_demo/blk00005.dat\n",
      "opened blocks_demo/blk00004.dat\n",
      "opened blocks_demo/blk00000.dat\n",
      "opened blocks_demo/blk00001.dat\n",
      "opened blocks_demo/blk00007.dat\n",
      "opened blocks_demo/blk00002.dat\n",
      "checking for cursors 00006\n",
      "checking for cursors 00004\n",
      "checking for cursors 00000\n",
      "checking for cursors 00005\n",
      "opened blocks_demo/blk00003.dat\n",
      "checking for cursors 00001\n",
      "checking for cursors 00002\n",
      "checking for cursors 00007\n",
      "cursor at 43942\n",
      "checking for cursors 00003\n",
      "cursor at 66491\n",
      "cursor at 27391457\n",
      "cursor at 25418670\n",
      "cursor at 75195\n",
      "cursor at 24567888\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "cursor at 70919\n",
      "cursor at 62048\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "trying to recover file from backup.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No back-up file.\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "No cursor file\n",
      "43942\n",
      "No cursor file\n",
      "70919\n",
      "75195\n",
      "27391457\n",
      "25418670\n",
      "24567888\n",
      "66491\n",
      "62048\n",
      "reading from 43942\n",
      "reading from 70919\n",
      "reading from 25418670\n",
      "reading from 24567888\n",
      "reading from 75195\n",
      "reading from 66491\n",
      "reading from 27391457\n",
      "reading from 62048\n",
      "Finished blocks_demo/blk00006.dat file. \n",
      "parsing script failed\n",
      "<built-in method with_traceback of SyntaxError object at 0x1099dd158>\n"
     ]
    }
   ],
   "source": [
    "manager(10, 4,2,1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "parsing blocks_demo/blk00000.dat\n",
      "parsing blocks_demo/blk00001.dat\n",
      "opened blocks_demo/blk00000.dat\n",
      "checking for cursors 00000\n",
      "parsing blocks_demo/blk00002.dat\n",
      "opened blocks_demo/blk00001.dat\n",
      "checking for cursors 00001\n",
      "No cursor file\n",
      "0\n",
      "No cursor fileopened blocks_demo/blk00002.dat\n",
      "checking for cursors 00002\n",
      "\n",
      "0\n",
      "No cursor file\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.chdir(\"/Users/oscareduardosernarosero/Desktop/neo4j-community-4.0.3/bin\")\n",
    "whereami = subprocess.check_output(\"pwd\")\n",
    "print(whereami)\n",
    "if whereami == b\"/Users/oscareduardosernarosero/Desktop/neo4j-community-4.0.3/bin\\n\": print(\"ok\")\n",
    "print(subprocess.check_output(\"ls\"))\n",
    "start_neo4j = subprocess.check_output(\"./neo4j start\",shell = True)\n",
    "if \"Started neo4j\" in str(start_neo4j): print(\"Sarted Neo4j successfully...\")\n",
    "else: print(\"Failed starting Neo4j.\")\n",
    "sleep(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "ename": "CalledProcessError",
     "evalue": "Command 'MATCH (n) RETURN n' returned non-zero exit status 2.",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mCalledProcessError\u001b[0m                        Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-57-f2f54fa574f5>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0;31m#output = Popen([\"./cypher-shell\",\"-u\",\"neo4j\",\"-p\",\"wallet\"],stdout=PIPE, stderr=PIPE)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0msubprocess\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcall\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"./cypher-shell -u neo4j -p wallet\"\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0mshell\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 4\u001b[0;31m \u001b[0moutput\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msubprocess\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcheck_output\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"MATCH (n) RETURN n\"\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0mshell\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      5\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0moutput\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/subprocess.py\u001b[0m in \u001b[0;36mcheck_output\u001b[0;34m(timeout, *popenargs, **kwargs)\u001b[0m\n\u001b[1;32m    393\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    394\u001b[0m     return run(*popenargs, stdout=PIPE, timeout=timeout, check=True,\n\u001b[0;32m--> 395\u001b[0;31m                **kwargs).stdout\n\u001b[0m\u001b[1;32m    396\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    397\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/anaconda3/lib/python3.7/subprocess.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(input, capture_output, timeout, check, *popenargs, **kwargs)\u001b[0m\n\u001b[1;32m    485\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcheck\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0mretcode\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    486\u001b[0m             raise CalledProcessError(retcode, process.args,\n\u001b[0;32m--> 487\u001b[0;31m                                      output=stdout, stderr=stderr)\n\u001b[0m\u001b[1;32m    488\u001b[0m     \u001b[0;32mreturn\u001b[0m \u001b[0mCompletedProcess\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocess\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mretcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstdout\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstderr\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    489\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mCalledProcessError\u001b[0m: Command 'MATCH (n) RETURN n' returned non-zero exit status 2."
     ]
    }
   ],
   "source": [
    "#os.chdir(\"/Users/oscareduardosernarosero/Desktop/neo4j-community-4.0.3/bin\")\n",
    "#output = Popen([\"./cypher-shell\",\"-u\",\"neo4j\",\"-p\",\"wallet\"],stdout=PIPE, stderr=PIPE)\n",
    "subprocess.call(\"./cypher-shell -u neo4j -p wallet\",shell = True)\n",
    "output = subprocess.check_output(\"MATCH (n) RETURN n\",shell = True)\n",
    "print(output)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b''\n"
     ]
    }
   ],
   "source": [
    "stdout, stderr = output.communicate(\"\\tMATCH (n) RETURN n\\n\")\n",
    "print (stdout)\n",
    "#subprocess.call(\"neo4j\",shell = True)\n",
    "#sleep(2)\n",
    "#loggedin = subprocess.check_output(\"wallet\",shell = True)\n",
    "#if \"Connected to Neo4j 4.0.3 at neo4j://localhost:7687 as user neo4j\" in str(loggedin):print(\"connected\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b\"\\xf9\\xbe\\xb4\\xd9\\x1d\\x01\\x00\\x00\\x01\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00;\\xa3\\xed\\xfdz{\\x12\\xb2z\\xc7,>gv\\x8fa\\x7f\\xc8\\x1b\\xc3\\x88\\x8aQ2:\\x9f\\xb8\\xaaK\\x1e^J)\\xab_I\\xff\\xff\\x00\\x1d\\x1d\\xac+|\\x01\\x01\\x00\\x00\\x00\\x01\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\xff\\xff\\xff\\xffM\\x04\\xff\\xff\\x00\\x1d\\x01\\x04EThe Times 03/Jan/2009 Chancellor on brink of second bailout for banks\\xff\\xff\\xff\\xff\\x01\\x00\\xf2\\x05*\\x01\\x00\\x00\\x00CA\\x04g\\x8a\\xfd\\xb0\\xfeUH'\\x19g\\xf1\\xa6q0\\xb7\\x10\\\\\\xd6\\xa8(\\xe09\\t\\xa6yb\\xe0\\xea\\x1fa\\xde\\xb6I\\xf6\\xbc?L\\xef8\\xc4\\xf3U\\x04\\xe5\\x1e\\xc1\\x12\\xde\\\\8M\\xf7\\xba\\x0b\\x8dW\\x8aLp+k\\xf1\\x1d_\\xac\\x00\\x00\\x00\\x00\\xf9\\xbe\\xb4\\xd9\"\n"
     ]
    }
   ],
   "source": [
    "with open(\"blocks_demo/blk00000.dat\",\"rb\") as block_file:\n",
    "    \n",
    "    print(block_file.read(297))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'0x14'"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "hex(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def write_block():\n",
    "    sleep(5)\n",
    "    print(\"wrote block\")\n",
    "    \n",
    "def write_tx():\n",
    "    sleep(15)\n",
    "    print(\"wrote transaction\")\n",
    "\n",
    "def parse_blockchain_demo(file):\n",
    "    #db = BlockChainDB( \"neo4j://localhost:7687\" ,\"neo4j\" ,\"wallet\" )\n",
    "    ok = True\n",
    "    i = 0\n",
    "    \n",
    "    #while True:\n",
    "        \n",
    "    try:\n",
    "        #with open(f\"blocks_demo/blk{i:05}.dat\",\"rb\") as block_file:\n",
    "        print(f\"openning {file}\")\n",
    "\n",
    "        while ok:\n",
    "\n",
    "            try:\n",
    "\n",
    "                #read_file_and_parse_block\n",
    "                sleep(5)\n",
    "                print(\"parsed block\")\n",
    "\n",
    "                write_block()\n",
    "\n",
    "                for transaction in range(random.randint(1, 2000)):\n",
    "                    #read_file_and_parse_transaction\n",
    "                    sleep(5)\n",
    "                    print(\"parsed transaction\")\n",
    "\n",
    "                    write_tx()\n",
    "                i+=1\n",
    "                if i>=25: raise Exception\n",
    "\n",
    "            except Exception as e:\n",
    "                print(f\"Finished blk{i:05} file. \")\n",
    "                i+=1\n",
    "                print(e)\n",
    "                print(e.with_traceback)\n",
    "                break\n",
    "    except:\n",
    "        print(\"Finsihed.\")\n",
    "        break\n",
    "\n",
    "    \n",
    "def main():\n",
    "    file_list = [f\"blocks_demo/blk{i:05}.dat\" for i in range(2)]\n",
    "    with concurrent.futures.ThreadPoolExecutor(max_workers=2) as executor:\n",
    "        executor.map(parse_blockchain_demo, file_list)\n",
    "        \n",
    "main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'blk.id': '000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f', 'blk.prev_block': '0000000000000000000000000000000000000000000000000000000000000000'}\n",
      "{'blk.id': '00000000839a8e6886ab5951d76f411475428afc90947ee320161bbf18eb6048', 'blk.prev_block': '000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f'}\n",
      "{'blk.id': '000000006a625f06636b8bb6ac7b960a8d03705d1ace08b1a19da3fdcc99ddbd', 'blk.prev_block': '00000000839a8e6886ab5951d76f411475428afc90947ee320161bbf18eb6048'}\n",
      "{'blk.id': '0000000082b5015589a3fdf2d4baff403e6f0be035a5d9742c1cae6295464449', 'blk.prev_block': '000000006a625f06636b8bb6ac7b960a8d03705d1ace08b1a19da3fdcc99ddbd'}\n",
      "{'blk.id': '000000004ebadb55ee9096c9a2f8880e09da59c0d68b1c228da88e48844a1485', 'blk.prev_block': '0000000082b5015589a3fdf2d4baff403e6f0be035a5d9742c1cae6295464449'}\n",
      "{'blk.id': '000000009b7262315dbf071787ad3656097b892abffd1f95a1a022f896f533fc', 'blk.prev_block': '000000004ebadb55ee9096c9a2f8880e09da59c0d68b1c228da88e48844a1485'}\n",
      "{'blk.id': '000000003031a0e73735690c5a1ff2a4be82553b2a12b776fbd3a215dc8f778d', 'blk.prev_block': '000000009b7262315dbf071787ad3656097b892abffd1f95a1a022f896f533fc'}\n",
      "{'blk.id': '0000000071966c2b1d065fd446b1e485b2c9d9594acd2007ccbd5441cfc89444', 'blk.prev_block': '000000003031a0e73735690c5a1ff2a4be82553b2a12b776fbd3a215dc8f778d'}\n",
      "{'blk.id': '00000000408c48f847aa786c2268fc3e6ec2af68e8468a34a28c61b7f1de0dc6', 'blk.prev_block': '0000000071966c2b1d065fd446b1e485b2c9d9594acd2007ccbd5441cfc89444'}\n",
      "{'blk.id': '000000008d9dc510f23c2657fc4f67bea30078cc05a90eb89e84cc475c080805', 'blk.prev_block': '00000000408c48f847aa786c2268fc3e6ec2af68e8468a34a28c61b7f1de0dc6'}\n"
     ]
    }
   ],
   "source": [
    "for r in p:\n",
    "    print(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.chdir(\"block_demo\")\n",
    "files = subprocess.check_output(\"ls\")\n",
    "files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
